BigBroBob2/bat_tag_nrf5340dk/src/main.c
#ifndef BT_H
#define BT_H 1
#include "bt.h"
#endif

#ifndef ICM42688_H
#define ICM42688_H 1
#include "icm42688.h"
#endif

#ifndef MIC_H
#define MIC_H 1
#include "pdm_microphone.h"
#endif

#ifndef SDCARD_H
#define SDCARD_H 1
#include "SDcard.h"
#endif


#ifndef CIRBUF_H
#define CIRBUF_H 1
#include "circular_buffer.h"
#endif


#ifndef NANEYEC_H
#define NANEYEC_H 1
#include "NanEyeC.h"
#endif


#include <nrfx_log.h>
#include <nrfx_gpiote.h>

#include <power/reboot.h>

// define order is important, must define before use
static int trial_count = 0;

/////////////////////////////////////////////////////////////////////////// Define circular buffer

// IMU circular buffer
static short imu_cbuf[N_circular_buf]; 
// IMU sample data circular buffer
static circular_buf imu_circle_buf = {
    .buf = imu_cbuf,
    .write_idx = 0,
    .read_idx = 0
};

// 2nd SPI IMU circular buffer
static short H_imu_cbuf[N_circular_buf]; 
// 2nd SPI IMU sample data circular buffer
static circular_buf H_imu_circle_buf = {
    .buf = H_imu_cbuf,
    .write_idx = 0,
    .read_idx = 0
};

/////////////////////////////////////////////////////////////////////////// finish define circular buf

//// SD card data file

// save file for audio
static struct fs_file_t mic_file;
// static struct fs_file_t imu_t_file;

// save file for camera frame
static struct fs_file_t video_file;

// save file for body imu
static struct fs_file_t imu_file;

// save file for head imu
static struct fs_file_t H_imu_file;

static int define_files() {
    int error;
    char filename[30];
    //////// mic_file for microphone audio data
    fs_file_t_init(&mic_file);
    printk("Opening mic_file path\n");
	sprintf(&filename, "/SD:/audio_%02d.dat", trial_count); 

    // delete mic_file if exist
    fs_unlink(filename);

	error = fs_open(&mic_file, filename, FS_O_CREATE | FS_O_WRITE);
    if (error) {
			printk("Error opening mic_file [%03d]\n", error);
			return 0;
		}

    ///////// imu_file for IMU data
    fs_file_t_init(&imu_file);
    printk("Opening imu_file path\n");

	sprintf(&filename, "/SD:/imu_%02d.dat", trial_count); 

    // delete imu_file if exist
    fs_unlink(filename);

	error = fs_open(&imu_file, filename, FS_O_CREATE | FS_O_WRITE);
    if (error) {
			printk("Error opening imu_file [%03d]\n", error);
			return 0;
		}

    //////// video_file for camera
    fs_file_t_init(&video_file);
    printk("Opening video_file path\n");

	sprintf(&filename, "/SD:/video_%02d.dat",trial_count); 

    // delete video_file if exist
    fs_unlink(filename);

	error = fs_open(&video_file, filename, FS_O_CREATE | FS_O_WRITE);
    if (error) {
			printk("Error opening video_file [%03d]\n", error);
			return 0;
		}

    ///////// H_imu_file for 2nd head IMU data
    fs_file_t_init(&H_imu_file);
    printk("Opening H_imu_file path\n");

	sprintf(&filename, "/SD:/h_imu_%02d.dat", trial_count); 

    // delete H_imu_file if exist
    fs_unlink(filename);

	error = fs_open(&H_imu_file, filename, FS_O_CREATE | FS_O_WRITE);
    if (error) {
			printk("Error opening H_imu_file [%03d]\n", error);
			return 0;
		}


    //////// imu_count_file for IMU count data
    // fs_file_t_init(&imu_count_file);
    // printk("Opening imu_count_file path\n");

	// sprintf(&filename, "/SD:/imu_c_%02d.dat",trial_count); 

    // // delete imu_count_file if exist
    // fs_unlink(filename);

	// error = fs_open(&imu_count_file, filename, FS_O_CREATE | FS_O_WRITE);
    // if (error) {
	// 		printk("Error opening imu_count_file [%03d]\n", error);
	// 		return 0;
	// 	}

    // return 0;
}

//////////////////////////////////////////////////////////////////////////////// camera thread
// bufer for write into video files
static uint8_t camera_buf[frame_block_size*frame_block_circular_buf_num];

static uint8_t camera_cbuf[frame_block_size*frame_block_circular_buf_num];
static uint16_t camera_count;

static uint32_t cam_t[1];

// static char camera_cbuf[frame_block_circular_buf_size]; 
// IMU sample data circular buffer
static frame_block_circular_buf camera_circle_buf = {
    .buf = &camera_cbuf,
    .write_idx = 0,
    .read_idx = 0
};

// image processing thread
struct k_thread image_processing_thread_data;
#define image_processing_THREAD_STACK_SIZE 512
#define image_processing_THREAD_PRIORITY -12
K_THREAD_STACK_DEFINE(image_processing_thread_stack_area, image_processing_THREAD_STACK_SIZE);
K_SEM_DEFINE(image_processing_thread_semaphore, 0, 1);

static void image_processing_thread_entry_point(void *p1, void *p2, void *p3) {
    while (true) {
        if (k_sem_take(&image_processing_thread_semaphore, K_FOREVER) == 0) {

            NRF_P0->PIN_CNF[13] = 1;
            NRF_P0->OUTSET |= 1 << 13;

            image_compress();
            // add timestamp
            memcpy(&Image_binary[6400],&cam_t[0],4); 

            frame_block_write_in_buf(&camera_circle_buf,&Image_binary[0]);

            NRF_P0->OUTCLR |= 1 << 13;
        }
    }
}

// SPI camera thread
struct k_thread camera_thread_data;
#define camera_THREAD_STACK_SIZE 512
#define camera_THREAD_PRIORITY -16
K_THREAD_STACK_DEFINE(camera_thread_stack_area, camera_THREAD_STACK_SIZE);
K_SEM_DEFINE(camera_thread_semaphore, 0, 1);

static void camera_thread_entry_point(void *p1, void *p2, void *p3) {
    while (true) {
        if (k_sem_take(&camera_thread_semaphore, K_FOREVER) == 0) {

            // can use this as timestamp of one frame
            cam_t[0] = k_cycle_get_32();
            
            NRF_P0->PIN_CNF[11] = 1;
            NRF_P0->OUTSET |= 1 << 11;

            // NanEye_ReadFrame();
            int key = irq_lock();
            
            for(int i=0; i < 4; ++i) {
                spi_ReadBuffer_sleep(&ImageBuf[i*80][0], 492*80, 200);
            }

            irq_unlock(key);

            k_sem_give(&image_processing_thread_semaphore);
            
            spi_ReadBytes(12); // End of frame, should be all zeros - read and discard.
            NanEye_WriteConfig();
            spi_WriteBuffer(camera_rwbuf, 966);
            spi_ReadBuffer(camera_rwbuf, 4*492);

            NRF_P0->OUTCLR |= 1 << 11;
    }
}
}

//////////////////////////////////////////////////////////////////////////////// IMU thread
// SPI IMU thread
static short imu_rbuf[9]; // small read buf to get direct data each time IRQ
static short imu_buf[N_circular_buf]; // IMU buffer
static short imu_cw_buf[N_circular_buf]; // IMU count write buffer
static int32_t imu_t; // timestamp for each IMU writing 
static uint16_t ICM_count = 0; // sample count within the buffer, be really careful with uint8_t and int8_t
// static uint16_t ICM_cw=0;

struct k_thread ICM_thread_data;
/*IMU processing thread*/
#define ICM_THREAD_STACK_SIZE 1024
/* IMU thread is a priority cooperative thread, less than PDM mic*/
#define ICM_THREAD_PRIORITY -16
K_THREAD_STACK_DEFINE(ICM_thread_stack_area, ICM_THREAD_STACK_SIZE);
K_SEM_DEFINE(ICM_thread_semaphore, 0, 1);

static void ICM_thread_entry_point(void *p1, void *p2, void *p3) {
    while (true) {
        if (k_sem_take(&ICM_thread_semaphore, K_FOREVER) == 0) {

            // get timestamp asap
            imu_t = k_cycle_get_32();

