BigBroBob2/bat_tag_nrf5340dk/src/main.c
    // define data files
    define_files();

    //////////////// Init NanEyeC camera
    NRF_P0->PIN_CNF[SCLK_pin] = 0;
	NRF_P0->PIN_CNF[SDAT_pin] = 0;
    InitSPI();
	NanEye_InitialConfig();
    ReSYNC();


    //////////////////////////////////////////////// SPI for second IMU

    if (enable_H_imu) {
        // check IMU binding
    if (!spi_dev1) {
        printk("spi_dev1 Binding failed.");
        return;
    }

    printk("H_IMU enabled, enable_H_imu=%d\n", enable_H_imu);
    printk("H_IMU sampling rate imu_fs=%.2f\n", ICM_SampRate(rate_idx));

    /// config SPI first
    H_ICM_SPI_config();

    // set IMU samping rate
    H_ICM_setSamplingRate(rate_idx);

    // enable interrupt
    H_ICM_enableINT();

    // enable sensor
    H_ICM_enableSensor();
    }
    else {
        printk("H_IMU disabled, enable_H_imu=%d\n", enable_H_imu);
    }

    ////////////////////////////////////////////  SPI devices IMU

    if (enable_imu) {
        // check IMU binding
    if (!spi_dev2) {
        printk("spi_dev2 Binding failed.");
        return;
    }
    
    printk("IMU enabled, enable_imu=%d\n", enable_imu);
    printk("IMU sampling rate imu_fs=%.2f\n", ICM_SampRate(rate_idx));
    
    /// config SPI first
    ICM_SPI_config();
    
    // set IMU samping rate
    ICM_setSamplingRate(rate_idx);

    // enable interrupt
    ICM_enableINT();

    // enable sensor
    ICM_enableSensor();
    }
    else {
        printk("IMU disabled, enable_imu=%d\n", enable_imu);
    }

    // GPIO configure interrupt
    // gpio_pin_interrupt_configure(GPIO_dev,ICM_INT_pin,GPIO_INT_EDGE_RISING);
    // gpio_init_callback(&ICM_INT_cb,ICM_INT_handler,BIT(ICM_INT_pin));
    // GPIOTE0 for secure
    IRQ_DIRECT_CONNECT(GPIOTE0_IRQn, 0, ICM_handler, 0);

    // try give semaphore as IMU interrupt
    // Event mode, P0.30 for interrupt, when rising edge
    // check NRF_GPIOTE->EVENTS_IN[0]
    nrf_gpiote_event_configure(NRF_GPIOTE0,6,30,GPIOTE_CONFIG_POLARITY_LoToHi);

    // try give semaphore as IMU interrupt
    // Event mode, P0.25 for interrupt, when rising edge
    // NRF_GPIOTE->CONFIG[0] = 0x00011901;
    // check NRF_GPIOTE->EVENTS_IN[0]
    nrf_gpiote_event_configure(NRF_GPIOTE0,7,25,GPIOTE_CONFIG_POLARITY_LoToHi);
    

    k_msleep(10);

    /////////////////////// printk enable_cam

    if (enable_cam) {
        printk("cam enabled, enable_cam=%d\n", enable_cam);
    }
    else {
        printk("cam disabled, enable_cam=%d\n", enable_cam);
    }

    //////////////////////////////////////////////// I2S for PDM mic

     /* Start a dedicated, high priority thread for audio processing. */
    k_tid_t processing_thread_tid = k_thread_create(
        &processing_thread_data,
        processing_thread_stack_area,
        K_THREAD_STACK_SIZEOF(processing_thread_stack_area),
        processing_thread_entry_point,
        NULL, NULL, NULL,
        PROCESSING_THREAD_PRIORITY, 0, K_NO_WAIT
    );


        if (!device_is_ready(i2s_rx_dev)) {
		printk("unable to find i2s_rx device\n");	
        }

        if (!configure_i2s_rx(i2s_rx_dev)) {
        printk("Failed to config streams\n", i2s_rx_dev->name);
		return 0;
        }

        // f_actual = f_source / floor(1048576*4096/MCKFREQ)
        printk("NRF I2S0 CONFIG.MCKFREQ = %d, f_actual = %.3f\n", NRF_I2S0->CONFIG.MCKFREQ, 0.00745*NRF_I2S0->CONFIG.MCKFREQ);


    ///////////////////////////////////////////////////////////////// START SAMPLE

     // thread for SD card
    
    // try to use thread to read IMU data
    k_tid_t ICM_thread_tid = k_thread_create(
        &ICM_thread_data,
        ICM_thread_stack_area,
        K_THREAD_STACK_SIZEOF(ICM_thread_stack_area),
        ICM_thread_entry_point,
        NULL, NULL, NULL,
        ICM_THREAD_PRIORITY, 0, K_NO_WAIT
    );
    // gpio_add_callback(GPIO_dev, &ICM_INT_cb);

    // use another thread to read 2nd IMU data
    k_tid_t H_ICM_thread_tid = k_thread_create(
        &H_ICM_thread_data,
        H_ICM_thread_stack_area,
        K_THREAD_STACK_SIZEOF(H_ICM_thread_stack_area),
        H_ICM_thread_entry_point,
        NULL, NULL, NULL,
        H_ICM_THREAD_PRIORITY, 0, K_NO_WAIT
    );

    // reset cirular buffer idx and processing_buffers
        // Reset variables at the start of each trial
    imu_circle_buf.read_idx = 0;
    imu_circle_buf.write_idx = 0;

    H_imu_circle_buf.read_idx = 0;
    H_imu_circle_buf.write_idx = 0;

    camera_circle_buf.read_idx = 0;
    camera_circle_buf.write_idx = 0;


    processing_buffers_1 = 0;  

    // clear count
    IMU_data[8] = 0;
    H_IMU_data[8] = 0;

    
    printk("Start recording..\n");

    // start I2S
    error = nrfx_i2s_start(&nrfx_i2s_buffers_1, AUDIO_BUFFER_WORD_SIZE, 0);
    
    nrf_i2s_int_enable(NRF_I2S0, NRF_I2S_INT_RXPTRUPD_MASK |
                                  NRF_I2S_INT_TXPTRUPD_MASK);
    

    // enable GPIOTE
    if (enable_imu) {
         NRF_GPIOTE0->EVENTS_IN[7] = 0;
        NRF_GPIOTE->INTENSET |= 0x00000080;
    }
    if (enable_H_imu) {
        NRF_GPIOTE0->EVENTS_IN[6] = 0;
        NRF_GPIOTE->INTENSET |= 0x00000040;
    }
    
    // enable gpiote event (IMU INT)
    if (enable_imu) {
        nrf_gpiote_event_enable(NRF_GPIOTE0, 7);
    }
    
    if (enable_H_imu) {
        nrf_gpiote_event_enable(NRF_GPIOTE0, 6);
    }
    
    // enable GPIOTE IRQ
    NRFX_IRQ_ENABLE(GPIOTE0_IRQn);
    NVIC_EnableIRQ(GPIOTE0_IRQn);
    irq_enable(GPIOTE0_IRQn);


    // start camera
    k_tid_t camera_thread_tid = k_thread_create(
        &camera_thread_data,
        camera_thread_stack_area,
        K_THREAD_STACK_SIZEOF(camera_thread_stack_area),
        camera_thread_entry_point,
        NULL, NULL, NULL,
        camera_THREAD_PRIORITY, 0, K_NO_WAIT
    );
    
    ///////////////////////////////////////// loop
    if (enable_cam) {
        while (trial_start && current_conn){
            k_sem_give(&camera_thread_semaphore);
            k_msleep(cam_interval);
        }
    }
    else {
        while (trial_start && current_conn){
            k_msleep(1000);
        }
    }
    
    ///////////////////// after loop
    nrf_i2s_int_disable(NRF_I2S0, NRF_I2S_INT_RXPTRUPD_MASK |
                                  NRF_I2S_INT_TXPTRUPD_MASK);
    nrfx_i2s_uninit();
    
    k_thread_abort(camera_thread_tid);
    k_thread_abort(ICM_thread_tid);
    k_thread_abort(H_ICM_thread_tid);
    k_thread_abort(processing_thread_tid);
    

    NRFX_IRQ_DISABLE(GPIOTE0_IRQn);
    NVIC_DisableIRQ(GPIOTE0_IRQn);
    irq_disable(GPIOTE0_IRQn);

    if (enable_imu) {
        NRF_GPIOTE->INTENCLR |= 0x00000080;
        nrf_gpiote_event_disable(NRF_GPIOTE0, 7);
    }
    if (enable_H_imu) {
        NRF_GPIOTE->INTENCLR |= 0x00000040;
    nrf_gpiote_event_disable(NRF_GPIOTE0, 6);
    } 

    k_msleep(1000);

	printk("Recording stopped\n");

	printk("File named in trial %02d successfully created\n", trial_count);		
	fs_close(&mic_file);
    fs_close(&imu_file);
    fs_close(&H_imu_file);
    fs_close(&video_file);
    // fs_close(&imu_count_file);

    k_msleep(1000);
    lsdir(disk_mount_pt);
    k_msleep(1000);

    // bt_le_adv_stop();

    trial_count = trial_count + 1;
}

printk("Bluetooth disconnected...Stop all\n");
return 0;
}
